tutorials/Figure10d/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices        
(
	//Back face
	(0          0           0)           //00
	(0.001      0           0)           //01
	(0.001      0.001       0)           //02
	(0          0.001       0)           //03
	//Front face
	(0          0           0.0005)      //04
	(0.001      0           0.0005)      //05
	(0.001      0.001       0.0005)      //06
	(0          0.001       0.0005)      //07
);

blocks          
(
	hex ( 0  1  2  3  4  5  6  7) (1 256 1) simpleGrading (1 4 1)	//00
);

edges           
(
);

boundary         
(
	BotWall
	{
		type     wall;
		faces
		(
			( 0  1  5  4)
		);
	}

	FreeStream
	{
		type     patch;
		faces
		(
			( 2  3  7  6)
		);
	}

	FrontNBack
	{
		type     empty;
		faces		
		(
			( 0  3  2  1)
			( 4  5  6  7)
		);
	}

	LeftSide
	{
		type     symmetryPlane;
		faces
		(
			( 0  4  7  3)
		);
	}
	
	RightSide
	{
		type     symmetryPlane;
		faces
		(
			( 1  2  6  5)
		);
	}
);

mergePatchPairs 
();

// ************************************************************************* //
